-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 13.124.215.149    Database: zooflix
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `predict`
--

DROP TABLE IF EXISTS `predict`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `predict` (
  `pd_no` int NOT NULL AUTO_INCREMENT,
  `create_date` datetime(6) NOT NULL,
  `nxt_value` int DEFAULT NULL,
  `pd_content` varchar(255) DEFAULT NULL,
  `pd_date` date NOT NULL,
  `pd_result` varchar(255) DEFAULT NULL,
  `pd_updown` bit(1) DEFAULT NULL,
  `pd_value` int NOT NULL,
  `pre_value` int DEFAULT NULL,
  `stock_name` varchar(255) NOT NULL,
  `user_no` int DEFAULT NULL,
  PRIMARY KEY (`pd_no`),
  KEY `FKemknf7b2fflbed2hejho50mox` (`user_no`),
  CONSTRAINT `FKemknf7b2fflbed2hejho50mox` FOREIGN KEY (`user_no`) REFERENCES `user` (`user_no`)
) ENGINE=InnoDB AUTO_INCREMENT=58 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `predict`
--

LOCK TABLES `predict` WRITE;
/*!40000 ALTER TABLE `predict` DISABLE KEYS */;
INSERT INTO `predict` VALUES (1,'2024-03-07 05:24:50.053389',73300,'그래프적으로 보면 내일은 떨어진다!','2024-03-08','실패',_binary '\0',72600,71900,'삼성전자',5),(2,'2024-03-07 05:25:06.467658',73600,'유한락스 고객문의에서 어이없는 답변을 해서 주가 하락할 거 같다','2024-03-08','실패',_binary '\0',69000,69800,'유한양행',2),(3,'2024-03-07 05:25:39.985907',75100,'엔시티 드림 3월에 컴백한다','2024-03-08','실패',_binary '\0',73000,70800,'에스엠',2),(4,'2024-03-08 05:26:20.388655',77400,'내 예측이 빗나갔길래 이번엔 또 하락하지 않을까요','2024-03-09','실패',_binary '',70000,70800,'유한양행',2),(5,'2024-03-08 05:27:05.641843',166600,'요즘 상승세다 요즘이 아닌 거 같긴 하지만..','2024-03-09','실패',_binary '',181000,173300,'SK하이닉스',2),(6,'2024-03-11 05:27:32.460058',165700,'단순 감이긴 한데요.. 원래 저는 촉이 좀 좋습니다 저 믿어보세요','2024-03-12','실패',_binary '',180000,171900,'SK하이닉스',2),(7,'2024-03-11 05:28:12.051707',76800,'유한락스 고객문의의 여파가 이제는 있지 않을까...','2024-03-12','실패',_binary '\0',72200,73600,'유한양행',2),(8,'2024-03-12 05:28:35.535445',163600,'https://n.news.naver.com/mnews/article/421/0007404013 기사 첨부합니다','2024-03-13','실패',_binary '',160000,165000,'SK하이닉스',2),(9,'2024-03-12 05:29:19.032028',76000,'https://n.news.naver.com/mnews/article/015/0004958719\n기사 보세요','2024-03-13','실패',_binary '',77300,76700,'유한양행',2),(10,'2024-03-13 05:29:59.312379',161900,'https://n.news.naver.com/mnews/article/009/0005271547\n원래 상승할 거 같다고 생각했어요','2024-03-14','실패',_binary '\0',166000,163000,'SK하이닉스',2),(11,'2024-03-13 05:30:39.233197',75200,'https://n.news.naver.com/mnews/article/015/0004958554\n알테오젠이 너무 상승세라 오히려 떨어질 것 같음','2024-03-14','성공',_binary '\0',75000,76000,'유한양행',2),(12,'2024-03-07 05:32:10.775771',55800,'카카오 분석 결과 12일엔 이 가격이 맞다...','2024-03-12','실패',_binary '',54200,52500,'카카오',5),(13,'2024-03-08 05:32:50.097082',165000,'흐름.. 흐름이야!','2024-03-11','실패',_binary '',172000,175000,'SK하이닉스',5),(14,'2024-03-08 05:33:19.047044',402500,'과거의 데이터를 정밀 분석했습니다.','2024-03-11','성공',_binary '\0',400500,404000,'LG에너지솔루션',5),(15,'2024-03-11 05:34:42.020791',190400,'오르락 내리락.. 이제 오르락 차례야..','2024-03-12','실패',_binary '',191000,190500,'NAVER',5),(16,'2024-03-11 05:35:13.056416',241500,'떨어지는 시기가 왔어..','2024-03-12','실패',_binary '\0',246000,248000,'현대차',5),(17,'2024-03-19 05:36:33.111396',11060,'https://kr.investing.com/news/stock-market-news/article-1024699\n15주년에 곧 프로모션 행사하네요','2024-03-29','실패',_binary '',11200,10730,'제주항공',2),(18,'2024-03-12 05:40:25.316405',72800,'채용을 많이하는 이유? 떡상 각이라.','2024-03-18','실패',_binary '',74100,73300,'삼성전자',5),(19,'2024-03-12 05:40:47.992027',97700,'흐름이 보인다...','2024-03-13','실패',_binary '',99500,97800,'LG전자',5),(20,'2024-03-13 05:55:23.969890',162500,'그래프가 내려간다.. 위험해!','2024-03-15','실패',_binary '\0',157500,163600,'SK하이닉스',5),(21,'2024-03-13 05:55:49.456029',54300,'나의 감이 말한다.. 이건 뜬다!','2024-03-15','실패',_binary '',55800,54800,'카카오',5),(22,'2024-03-07 05:58:46.905522',402500,'지금 너무 떨어져있으니 다시 오를거야.','2024-03-08','성공',_binary '',400000,393500,'LG에너지솔루션',1),(23,'2024-03-07 05:59:13.704572',171900,'외국인과 기관이 현재 많이 팔고 있다.','2024-03-08','실패',_binary '\0',160000,162700,'SK하이닉스',1),(24,'2024-03-08 06:01:33.913095',400500,'지금 너무 떨어져있어. 조금씩 오를거야','2024-03-11','실패',_binary '',405000,401000,'LG에너지솔루션',1),(25,'2024-03-08 06:02:26.523305',166600,'계속 오르는 중이고 반도체주가 강세라고 함!','2024-03-11','실패',_binary '',175000,172300,'SK하이닉스',1),(26,'2024-03-11 06:06:18.901121',419500,'그냥 올라. 그냥 믿어.','2024-03-12','실패',_binary '',410000,403500,'LG에너지솔루션',1),(27,'2024-03-11 06:06:40.822197',165700,'너무 많이 올라서 떨어질 듯?','2024-03-12','실패',_binary '\0',161000,166500,'SK하이닉스',1),(28,'2024-03-07 06:11:27.850459',418500,'23.11.06 많은 거래량으로 저점을 구축한 것으로 보이고 현재는 저점 다지기로 보입니다.','2024-03-12','실패',_binary '',413000,393000,'LG에너지솔루션',13),(29,'2024-03-07 06:11:51.223184',53200,'키티 매매법이라고 아십니까?...','2024-03-08','실패',_binary '\0',50500,52400,'카카오',13),(30,'2024-03-08 06:12:15.113617',166600,'미국발 반도체주가 오르면서 엔비디아에 수출 중인 SK하이닉스 주가가 오르는 중 ','2024-03-11','실패',_binary '',178000,172300,'SK하이닉스',13),(31,'2024-03-07 06:14:04.597930',73300,'하루는 오르고 하루는 떨어지더라','2024-03-08','성공',_binary '\0',73000,72700,'삼성전자',4),(32,'2024-03-07 06:14:24.403106',171900,'기술 유출 심각단계라는 뉴스를 보았다.','2024-03-08','실패',_binary '\0',160000,162000,'SK하이닉스',4),(33,'2024-03-08 06:14:41.608112',73300,'너무오르고있어서 떨어질거같은데요','2024-03-09','실패',_binary '',73000,72600,'삼성전자',7),(34,'2024-03-08 06:14:56.111077',166000,'갑자기 오르는 추세.. 이거 머지..? 살짝 무지성.. 엔비디아관련 뉴스 확인 해보니 오를거같다.','2024-03-11','실패',_binary '',175000,171700,'SK하이닉스',4),(35,'2024-03-11 06:15:10.832003',161500,'엔비디아 영향이 있을듯?','2024-03-13','실패',_binary '',170000,166500,'SK하이닉스',4),(36,'2024-03-12 06:15:16.308639',161200,'미국발 반도체주가 오르면서 엔비디아에 수출 중인 SK하이닉스 주가가 오르는 중 ','2024-03-15','실패',_binary '',190000,165700,'SK하이닉스',13),(37,'2024-03-19 06:15:25.807966',61400,'하나금융은 ai를 잘한다.','2024-03-20','성공',_binary '',63000,61700,'하나금융지주',4),(38,'2024-03-11 06:16:04.752976',307000,'큰 변동은 없는 것으로 보인다..','2024-03-12','실패',_binary '\0',313000,316500,'삼성화재',13),(39,'2024-03-11 06:16:32.227453',73300,'삼성이니까 오르지 않을까?','2024-03-12','성공',_binary '\0',73400,72900,'삼성전자',13),(40,'2024-03-18 06:22:01.324848',78900,'안전하고 꾸준하게 오른다..','2024-03-22','실패',_binary '',74300,72700,'삼성전자',13),(41,'2024-03-18 06:23:32.817558',53600,'흠.. 지금은 하락할 시기군','2024-03-22','실패',_binary '\0',51600,52700,'카카오',13),(42,'2024-03-08 06:32:30.852824',15990,'그냥 믿어. 그럼 올라.','2024-03-28','실패',_binary '',20000,15130,'큐브엔터',6),(43,'2024-03-07 06:34:02.500822',161500,'https://cafe.naver.com/ustock 카페에서 시장주도주 중 하나로 보고있음 근데 오늘 꽤 떨어져서 다시 16만 이상으로 오를거로 예상됨','2024-03-08','성공',_binary '',162000,159400,'현대차우',3),(44,'2024-03-08 06:34:20.862839',114700,'2차전지 관련 주로  현재 관련 주식이 평균 12% 이상 상승하였음\n한농화성, 파이텐,.필에너지ㅣ 자이글  등 현재 호재가 있음','2024-03-15','실패',_binary '',110000,103300,'SKC',7),(45,'2024-03-18 06:34:43.857222',13570,'2차전지 관련 주로  현재 관련 주식이 평균 12% 이상 상승하였음\n한농화성, 파이텐,.필에너지ㅣ 자이글  등 현재 호재가 있음','2024-03-15','실패',_binary '',15000,14180,'엠케이전자',7),(46,'2024-03-08 06:34:49.912494',0,'https://n.news.naver.com/mnews/article/008/0005009210\n2차전지 관련으로 계속해서 오를것으로 예상','2024-03-11','실패',_binary '\0',450000,430500,'삼성에스디에스',3),(47,'2024-03-11 06:35:09.439965',413500,'https://n.news.naver.com/mnews/article/015/0004958246\nhttps://n.news.naver.com/mnews/article/008/0005010013\n엔터주 호재뉴스','2024-03-13','실패',_binary '\0',205000,201500,'하이브',3),(48,'2024-03-08 06:35:25.911549',72400,'어제는 떨어졌으니까.. 올라라…. 기원2일차','2024-03-11','실패',_binary '\0',68000,72500,'삼성전자',4),(49,'2024-03-12 06:35:48.707028',73300,'육만전자 가면 풀매수할거예요 나의 바람','2024-03-13','실패',_binary '\0',71500,75000,'삼성전자',4),(50,'2024-03-21 06:36:09.185720',79300,'오르는 추세 !! 팔만전자 갈거같아요','2024-03-22','성공',_binary '\0',79000,75000,'삼성전자',4),(51,'2024-03-26 06:36:27.858193',79900,'찐으로 팔만전자 찍을거같아','2024-03-27','성공',_binary '',80000,76000,'삼성전자',4),(52,'2024-04-01 06:37:26.014235',0,'https://n.news.naver.com/mnews/article/658/0000070345\n기사처럼 구만전자를 향해 갈거같아요','2024-04-05',NULL,_binary '',85000,80000,'삼성전자',4),(53,'2024-03-08 06:37:29.843648',0,'근거, 155MM 사거리 연장탄 금년도 실전 배치 예정으로 인한 판매량 증가 + 해외 수출 기대','2024-04-05',NULL,_binary '',50000,48150,'풍산',8),(54,'2024-03-26 08:20:04.023968',0,'https://n.news.naver.com/mnews/article/009/0005278668\n삼성이 올랐듯이 엘지도 갑니다','2024-04-04',NULL,_binary '',406600,376000,'LG에너지솔루션',14),(55,'2024-03-27 08:21:25.312716',0,'내가 몸담고 있는 곳인데 오를테죠','2024-04-05',NULL,_binary '',43000,37250,'멀티캠퍼스',10),(57,'2024-04-03 11:57:37.000012',0,'우리 조합은 무조건 상승입니다.','2024-04-23',NULL,_binary '',400000,301500,'삼성화재',4);
/*!40000 ALTER TABLE `predict` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-04  4:03:54
